find_my_device_app/application/app/controllers/api/v1/devices_controller.rb

    def register_device
        code, imei = params.values_at :code, :imei
        @device = Device.where(:registration_code => code)
        if (@device != nil && @device.length > 0)
          if (Device.where(:imei => imei).latitude > 0)
            render plain: 'This device is already tied to an account. For help contact support@device-finder.com', content_type: 'text/plain', status: 401
          else
            @device[0].update(:imei => imei, :registration_status => "registered", :registration_code => "")
---
SELECT "devices".* FROM "devices" WHERE "devices"."registration_code" = $1  [["registration_code", "855701"]]
UPDATE "devices" SET "imei" = $1, "registration_status" = $2, "registration_code" = $3 WHERE "devices"."id" = $4  [["imei", "mytestimei855701"], ["registration_status", "registered"], ["registration_code", ""], ["id", 17]]

    def check_device_status
        imei, latitude, longitude = params.values_at :imei, :latitude, :longitude
        if (imei == nil || imei == "")
            render json: {
              message: "Bad Imei Given"
            }, status: 201
            return
        end
        device = Device.find_by_imei(imei)
        if (device == nil)
            render json: {
              message: "Device is not registered"
            }, status: 404
            return
        end
        if (device.status == "missing")
            newLocation = {
                latitude: latitude,
                longitude: longitude,
                timestamp: Time.zone.now()
            }
            device.update(:known_locations => device.known_locations << newLocation)
            device.save
---
SELECT "devices".* FROM "devices" WHERE "devices"."imei" = $1 LIMIT $2  [["imei", "mytestimei763411"], ["LIMIT", 1]]
UPDATE "devices" SET "known_locations" = $1 WHERE "devices"."id" = $2
UPDATE "devices" SET "known_locations" = $1 WHERE "devices"."id" = $2  [["known_locations", "{\"{\\\"latitude\\\":\\\"41.3800122\\\",\\\"longitude\\\":\\\"-96.267519\\\",\\\"timestamp\\\":\\\"2019-12-07T04:55:48.494Z\\\"}\"}"], ["id", 17]]

  def create
      name, user_id, device_type_id = params.values_at :name, :user_id, :device_type_id
      registration_code = generate_registration_code
    if (user_id != nil && user = User.find_by_id(user_id) != nil)
        @new_device = Device.new(:name => name, :registration_code => registration_code, :user_id => user_id)
        @new_device.device_type_id = device_type_id
        if @new_device.save
          device_type = DeviceType.find_by_id(device_type_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "4c836407-7ffa-41a5-81c6-d2ec0f527e44"], ["LIMIT", 1]]
INSERT INTO "devices" ("name", "registration_code", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test Device"], ["registration_code", "530803"], ["user_id", "4c836407-7ffa-41a5-81c6-d2ec0f527e44"]]
SELECT "device_types".* FROM "device_types" WHERE "device_types"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def set_device_status
    device_id, status = params.values_at :device_id, :status
    if (status == "missing" || status == "pending-found" || status == "good-standing")
        if (device_id != nil && @device = Device.find_by_id(device_id))
          @device.update(:status => status)
          @device.save
---
SELECT "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "devices" SET "status" = $1 WHERE "devices"."id" = $2  [["status", "missing"], ["id", 5]]
UPDATE "devices" SET "status" = $1 WHERE "devices"."id" = $2  [["status", "missing"], ["id", 17]]

  def map_devices(devices)
    @mapped_devices = []
    devices.each do |device|
      device_object = device
      device_type = DeviceType.find_by_id(device.device_type_id)
      if (device_type != nil)
        device_object["type_name"] = device_type.name
        device_object["type_photo_url"] = device_type.photo_url
      else
        unkown_device = DeviceType.find_by_id("1")
---
SELECT "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT "device_types".* FROM "device_types" WHERE "device_types"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "device_types".* FROM "device_types" WHERE "device_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def delete_device
    device_id = params.values_at :device_id
    @device = Device.find_by_id(device_id)
    user_id = @device.user_id
    if (Device.destroy(device_id))
      render json: { devices: map_devices(User.find_by_id(user_id).devices) }, status: 201
---
SELECT "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "devices" WHERE "devices"."id" = $1  [["id", 10]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "bd7244a4-cd99-4a1d-9629-99fa3cf58c14"], ["LIMIT", 1]]

  def add_device_type
    name, photo_url = params.values_at :name, :photo_url
    @new_device_type = DeviceType.new(:name => name, :photo_url => photo_url)

    if @new_device_type.save
---
INSERT INTO "device_types" ("name", "photo_url") VALUES ($1, $2) RETURNING "id"  [["name", "iPhone XS"], ["photo_url", "https://images-na.ssl-images-amazon.com/images/I/61hBc3oHjyL._SX425_.jpg"]]