find_my_device_app/application/app/controllers/application_controller.rb

  def authenticate_user
    token = cookies.signed['X-Access-Token']
    user_id = TokenManager.validate_token(token)
    if (user_id)
      @current_user = User.find_by_id(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "4c836407-7ffa-41a5-81c6-d2ec0f527e44"], ["LIMIT", 1]]