find_my_device_app/application/app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jhalpert@dundermifflin.com"], ["LIMIT", 1]]
---
    def authenticate
      command = AuthenticateUser.call(params[:email], params[:password])

      if command.success?
        puts command.result
        #response.headers["X-Access-Token"] = command.result
        # response.set_header('X-Access-Token', command.result)
        # request.set_header('X-Access-Token', command.result)
        response.set_header('X-Access-Token', 'testfromauth')
        request.set_header('X-Access-Token', 'testfromauth')
        #headers["X-Access-Token"] = command.result
        #render json: { auth_token: command.result }
        user = User.find_by_email(params[:email])