find_my_device_app/application/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "pbeasly@dundermifflin.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "first_name", "last_name", "username") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def submit_create
    first_name, last_name, email, username, password, confirm_password = params.values_at :first_name, :last_name, :email, :username, :password, :confirm_password
    if (!User.find_by_email(email))
      @new_user = User.new(:first_name => first_name, :last_name => last_name, :email => email, :username => username, :password => password)
      @new_user.save

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "mscott@dundermifflin.com"], ["LIMIT", 1]]
---
  def submit_login
    puts 'Submit login'
    email, password = params.values_at :email, :password
    if (user = User.find_by_email(email)&.authenticate(password))

SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = $1  [["user_id", "bd7244a4-cd99-4a1d-9629-99fa3cf58c14"]]
SELECT "device_types".* FROM "device_types" WHERE "device_types"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def map_devices(devices)
    @mapped_devices = []
    devices.each do |device|
      device_object = device
      device_type = DeviceType.find_by_id(device.device_type_id)
      if (device_type != nil)
        device_object["type_name"] = device_type.name
        device_object["type_photo_url"] = device_type.photo_url
      else
        unkown_device = DeviceType.find_by_id("1")

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "bd7244a4-cd99-4a1d-9629-99fa3cf58c14"], ["LIMIT", 1]]
SELECT "devices".* FROM "devices" WHERE "devices"."user_id" = $1  [["user_id", "4c836407-7ffa-41a5-81c6-d2ec0f527e44"]]
SELECT "device_types".* FROM "device_types"
---
  def show
    if current_user != nil && current_user.id == params[:id]
      @user = User.find_by_id(params[:id])
      @devices = map_devices(Device.where(:user_id => @user.id))
      @device_types = DeviceType.all