find_my_device_app/application/app/commands/authenticate_user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jhalpert@dundermifflin.com"], ["LIMIT", 1]]
---
    def user
      user = User.find_by_email(email)